---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarHandleType.Edge
enum: Autodesk.Revit.DB.Structure.RebarHandleType
source: html/0773859c-5f30-3fb4-25b3-34c80432aaa4.htm
---
# Autodesk.Revit.DB.Structure.RebarHandleType.Edge

Handle controlling location of a single edge segment of the Rebar.
 Drives the edge in the direction perpendicular to the edge and
 in the Rebar's primary plane.